''' if의 구조

    if 조건문 :
        수행할 문장 1
        수행할 문장 2
        ...
    else :
        수행할 문장 A
        수행할 문장 B
        ...

    *들여쓰기를 필수적으로 해주어야 한다. (그렇지 않으면 에러가 발생)
    *조건문 뒤에 클론을 쓰지 않을 경우 문제가 발생한다

    조건이 참인지 아닌지를 알아볼때는 자료형보다 비교연산자를 애용
    파이썬의 비교연산자
    '<','>','==','!=','>=','<='

    다른 연산자들
    'and', 'or', 'not'
    'in' -> 리스트, 튜플, 문자열에 x가 있는지 확인

    else if = elif

    앞의 pass를 사용한 예를 보면
    if문 다음에 수행할 문장이 한 줄이고, else문 다음에 수행할 문장도
    한 줄 밖에 되지 않는다.

'''
