'''
    모듈이란 이전에 만들었던 프로그램에 있던 함수를 가져오는 것이다. 헤더라고도 볼 수 있겠다.
    import문을 통해 사용할 수 있다.

    ex) import module

    .py는 붙이지 않고 사용한다.
    모듈에 내장된 함수를 불러오는 법은 '.'연산자를 이용한다.
'''


'''

    이전에 만들었던 프로그램에서 만들었던 모든 것을 적용하기 때문에
    print문 같이 출력문이 같이 실행되기도 한다.
    그런 경우 다음의 문장을 출력문장 위에 올려주면 된다.

    if __name__ == "__main__"

    파이썬은 실행하는 프로그램이 메모리 내에서 __main__이란 이름으로 저장되기 때문에,
    __main__이 아니면 실행을 막는 명령문이다selfself.

'''

'''
    불러오고픈 모듈중에 클래스가 있을 경우 따로 초기화를 해주면 된다.
    일례로는 modules.py를 참고하자
    또한 모듈의 변수를 가져오고 싶을 때가 있을텐데,
    그 경우 <모듈이름.변수이름>을 이용하면 불러올 수 있다.
    
'''
